<a href="https://colab.research.google.com/github/Ellana555/Skillfactory/blob/main/8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd

sample = pd.read_csv('sample.csv')

In [7]:
columns = sample.columns

In [9]:
columns = [x.lower() for x in columns]
columns

['name', 'city', 'age', 'profession']

In [ ]:
sample.columns = ['name', 'city', 'age', 'profession']

In [11]:
log = pd.read_csv('log.csv', header = None)
log.columns = ['user_id', 'time', 'bet', 'win']

In [14]:
users = pd.read_csv('users.csv', delimiter = '\t', encoding = 'koi8-r' )
users.columns

Index(['Юзверь', 'мейл', 'Гео'], dtype='object')

In [16]:
sample.Name.str.match("К", na = False)

0     False
1     False
2     False
3     False
4     False
5      True
6     False
7      True
8     False
9     False
10    False
Name: Name, dtype: bool

In [19]:
sample[~sample.Name.str.match("К", na=False)]

          Name         City  Age Profession
0       Иванов       Москва   25     Клинер
1          NaN    Волгоград   31   Менеджер
2       Иванов       Москва   25     Клинер
3      sidorov  Владивосток   43   Менеджер
4      _______        Курск   50   Водитель
6        Сажин       Сургут   29    Рабочий
8   Завалишина    Чебоксары   36   Менеджер
9       Левина          NaN   55    Рабочий
10        Фикс         Рига   42    Рабочий

In [ ]:
# где в городах есть буква о
sample3 = sample[sample.City.str.contains("о", na=False)]

In [21]:
# где в городах нет буквы о
sample4 = sample[~sample.City.str.contains("о", na=False)]

Преобразование данных

In [22]:
#Возведём возраст в sample в квадрат:
sample.Age.apply(lambda x:x**2)

0      625
1      961
2      625
3     1849
4     2500
5      361
6      841
7     1024
8     1296
9     3025
10    1764
Name: Age, dtype: int64

In [23]:
def func(x):
    if x<20:
        return x
    else:
        return 0
sample.Age.apply(func)

0      0
1      0
2      0
3      0
4      0
5     19
6      0
7      0
8      0
9      0
10     0
Name: Age, dtype: int64

In [24]:
def func(x):
    if x<20:
        return x
    else:
        return 0
sample.Age.apply(func)

0      0
1      0
2      0
3      0
4      0
5     19
6      0
7      0
8      0
9      0
10     0
Name: Age, dtype: int64

In [39]:
# С помощью apply и лямбда-функции увеличьте
# возраст во всех записях на 1 год и сохраните в sample2.
sample2 = sample.copy()
sample2['Age'] = sample['Age'].apply(lambda x: x + 1)
print(sample2)

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [46]:
#С помощью apply и lambda-функции замените
#все буквы в поле City на маленькие и
#сохраните в sample2. Вам может понадобиться
#функция s.lower().
sample2['City'] = sample.City.apply(lambda x: str(x).lower())
print(sample2)

            Name         City  Age Profession
0         Иванов       москва   25     Клинер
1            NaN    волгоград   31   Менеджер
2         Иванов       москва   25     Клинер
3        sidorov  владивосток   43   Менеджер
4        _______        курск   50   Водитель
5       Кузнецов         сочи   19    Рабочий
6          Сажин       сургут   29    Рабочий
7   Котлеревский   йошкар-ола   32    Рабочий
8     Завалишина    чебоксары   36   Менеджер
9         Левина          nan   55    Рабочий
10          Фикс         рига   42    Рабочий

In [56]:
def profession_code(value:str):
    if value == 'Рабочий':
        return 0
    if value == 'Менеджер':
        return 1
    else:
        return 2

sample2['Profession'] = sample2.apply(lambda x: profession_code(x['Profession']), axis = 1)
print(sample2)

            Name         City  Age  Profession
0         Иванов       москва   25           2
1            NaN    волгоград   31           2
2         Иванов       москва   25           2
3        sidorov  владивосток   43           2
4        _______        курск   50           2
5       Кузнецов         сочи   19           2
6          Сажин       сургут   29           2
7   Котлеревский   йошкар-ола   32           2
8     Завалишина    чебоксары   36           2
9         Левина          nan   55           2
10          Фикс         рига   42           2

In [62]:
def age_category(age):
    if age < 23:
        return "молодой"
    if 23 <= age <= 35:
        return "средний"
    else:
        return "зрелый"

sample['Age_category'] = sample.apply(lambda x: age_category(x['Age']), axis = 1)
print(sample)

            Name         City  Age Profession Age_category
0         Иванов       Москва   25     Клинер      средний
1            NaN    Волгоград   31   Менеджер      средний
2         Иванов       Москва   25     Клинер      средний
3        sidorov  Владивосток   43   Менеджер       зрелый
4        _______        Курск   50   Водитель       зрелый
5       Кузнецов         Сочи   19    Рабочий      молодой
6          Сажин       Сургут   29    Рабочий      средний
7   Котлеревский   Йошкар-Ола   32    Рабочий      средний
8     Завалишина    Чебоксары   36   Менеджер       зрелый
9         Левина          NaN   55    Рабочий       зрелый
10          Фикс         Рига   42    Рабочий       зрелый

In [121]:
#Преобразуем поле user_id в датафрейме log,
#оставив только идентификатор пользователя.
#Например, вместо "Запись пользователя
#№ — user_974" должно остаться только "user_974".

log = pd.read_csv('log.csv', header = None)
log.columns = ['user_id','time','bet','win']

#log['user_id'] = log['user_id'].replace("Запись пользователя № - ", "")
#log['user_id'] = log['user_id'].replace("#error", "")
# Функция для извлечения user_id
def extract_user_id(text):
    if text.startswith('Запись пользователя № - '):
        return text.split(' - ')[1].strip()
    else:
        return text

# Применение функции к столбцу 'user_id'
log['user_id'] = log['user_id'].apply(lambda x: extract_user_id(x))
log['user_id'] = log['user_id'].replace("#error", "")
print(log)

      user_id                  time      bet      win
0    user_919  [2019-01-01 14:06:51      NaN      NaN
1    user_973  [2019-01-01 14:51:16      NaN      NaN
2    user_903  [2019-01-01 16:31:16      NaN      NaN
3    user_954  [2019-01-01 17:17:51      NaN      NaN
4    user_954  [2019-01-01 21:31:18      NaN      NaN
..        ...                   ...      ...      ...
995  user_984   [2019-04-20 9:59:58   9754.0      NaN
996                             NaN  10054.0  29265.0
997                             NaN  10454.0      NaN
998                             NaN   1000.0      NaN
999                             NaN  10754.0      NaN

[1000 rows x 4 columns]

In [133]:
# Загрузите log.csv в log.
# Удалите квадратную скобку из первой строки
# в столбце time, чтобы привести его к более
# привычному формату: t равен log.time[0].
# Сохраните результат в t:
log = pd.read_csv("log.csv", header = None)
log.columns = ['user_id','time','bet','win']
t = log.time[0]
# Удалите квадратную скобку из t, чтобы привести его к более привычному формату
t = t.replace("[", '')
print(t)

2019-01-01 14:06:51

In [138]:
log['time'] = log['time'].str.replace("[", "")
print(log)
#log['user_id'] = log['user_id'].apply(lambda x: extract_user_id(x))

                              user_id                 time      bet      win
0    Запись пользователя № - user_919  2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  2019-01-01 21:31:18      NaN      NaN
..                                ...                  ...      ...      ...
995  Запись пользователя № - user_984   2019-04-20 9:59:58   9754.0      NaN
996                            #error                  NaN  10054.0  29265.0
997                            #error                  NaN  10454.0      NaN
998                            #error                  NaN   1000.0      NaN
999                            #error                  NaN  10754.0      NaN

[1000 rows x 4 columns]

In [143]:
#Финал
def extract_user_id(text):
    if text.startswith('Запись пользователя № - '):
        return text.split(' - ')[1].strip()
    else:
        return text

log = pd.read_csv('log.csv', header = None)
log.columns = ['user_id','time','bet','win']
log = log[~log.user_id.str.contains("#error", na = False)]
log['user_id'] = log['user_id'].apply(lambda x: extract_user_id(x))
log['time'] = log['time'].str.replace("[", "")
print(log)

      user_id                 time      bet     win
0    user_919  2019-01-01 14:06:51      NaN     NaN
1    user_973  2019-01-01 14:51:16      NaN     NaN
2    user_903  2019-01-01 16:31:16      NaN     NaN
3    user_954  2019-01-01 17:17:51      NaN     NaN
4    user_954  2019-01-01 21:31:18      NaN     NaN
..        ...                  ...      ...     ...
991  user_965  2019-04-20 12:55:41    800.0  6927.0
992  user_967  2019-04-20 14:59:36  10154.0     NaN
993  user_973  2019-04-20 17:09:56  10254.0     NaN
994  user_977  2019-04-20 18:10:07  10354.0     NaN
995  user_984   2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]